In [1]:
import sqlite3
import pandas as pd

In [2]:
# Read CSV file 
csv_file = '/Users/owner/Desktop/data_science/ml_course/aipi510/aipi510-fall24/data/tips.csv'
df = pd.read_csv(csv_file)

# Create an SQLite connection (a new database file)
conn = sqlite3.connect('tips')  

# Insert the DataFrame into an SQLite table
df.to_sql('tips', conn, if_exists='replace', index=False)

244

In [12]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [100]:
cursor = conn.cursor()
cursor.execute("SELECT * FROM tips LIMIT 5")

In [101]:
# Fetch all rows
rows = cursor.fetchall()
display = pd.DataFrame()
for row in rows:
    display = pd.concat([display, pd.DataFrame(list(row)).T], axis="rows")
display.columns = df.columns
display

  total_bill   tip     sex smoker  day    time size
0      16.99  1.01  Female     No  Sun  Dinner    2
0      10.34  1.66    Male     No  Sun  Dinner    3
0      21.01   3.5    Male     No  Sun  Dinner    3
0      23.68  3.31    Male     No  Sun  Dinner    2
0      24.59  3.61  Female     No  Sun  Dinner    4

In [107]:
def make_query(conn, sql_query, columns, commit=False):
    """_summary_
    Run a SQL query into a connected database, with option to commit.
    Args:
        conn (_type_): a sqlite connection, if already done
        sql_query (_type_): _description_
    """
    if not conn:
        # Read CSV file 
        csv_file = '/Users/owner/Desktop/data_science/ml_course/aipi510/aipi510-fall24/data/tips.csv'
        df = pd.read_csv(csv_file)

        # Create an SQLite connection "tips" (a new database file)
        conn = sqlite3.connect('tips')  

        # Insert the DataFrame into an SQLite table
        df.to_sql('tips', conn, if_exists='replace', index=False)

    # Create a cursor 
    cursor = conn.cursor()
    # Run sql query
    cursor.execute(sql_query)
    # fetch all matching rows
    rows = cursor.fetchall()

    display = pd.DataFrame()
    for row in rows:
        display = pd.concat([display, pd.DataFrame(list(row)).T], axis="rows")
    display.columns = columns

    # user option to save changes
    if commit is True:
        conn.commit()

    return display

    # close connection
    # conn.close()

In [108]:
make_query(conn, "SELECT * FROM tips LIMIT 5", df.columns)

  total_bill   tip     sex smoker  day    time size
0      16.99  1.01  Female     No  Sun  Dinner    2
0      10.34  1.66    Male     No  Sun  Dinner    3
0      21.01   3.5    Male     No  Sun  Dinner    3
0      23.68  3.31    Male     No  Sun  Dinner    2
0      24.59  3.61  Female     No  Sun  Dinner    4